[
  {
    "id": 1,
    "subject": "Airport Approval Notification",
    "body": "Hello John,\n\nThis is to confirm that Airdrie Air Park (CEF4) has been approved to be designated as an airport of CANPASS (ADE/CAN). The approval is effective as of March 1, 2025. We request that you update the Central Flight System (CFS) with the new designation and circulate this update to all relevant departments. If you require further details, please do not hesitate to reach out.\n\nBest regards,\nAdmin Team",
    "sender": "admin@canpass.ca",
    "recipient": "john.doe@aixm.ca",
    "date": "2024-02-15",
    "category": "Airport Approval"
  },
  {
    "id": 2,
    "subject": "Runway Modification Request",
    "body": "Dear Jane,\n\nFollowing the latest inspection report, we have identified that Runway 09L/27R at Toronto Pearson International (CYYZ) requires urgent resurfacing and an update in its maintenance scheduling. The current surface condition has been flagged as below optimal safety standards, and immediate remedial action is advised.\n\nPlease review the attached inspection report for detailed observations and coordinate with the engineering team to initiate the repair process. Your prompt action is appreciated.\n\nThank you,\nMaintenance Department",
    "sender": "maintenance@airport.ca",
    "recipient": "jane.smith@aixm.ca",
    "date": "2024-03-01",
    "category": "Runway Modification"
  },
  {
    "id": 3,
    "subject": "NOTAM: Runway Closure Notification",
    "body": "Hi Team,\n\nThis is to inform you that NOTAM: Temporary closure of Runway 16/34 at Calgary International (CYYC) is scheduled due to planned maintenance work. The closure will be effective from April 15, 2025, until further notice. All flight operations and scheduling must be adjusted accordingly.\n\nPlease disseminate this information to all affected operational units and update the system records. Further updates will be provided as maintenance progresses.\n\nRegards,\nOperations",
    "sender": "operations@canpass.ca",
    "recipient": "ops.team@aixm.ca",
    "date": "2024-03-15",
    "category": "NOTAM"
  },
  {
    "id": 4,
    "subject": "Procedure Update for Instrument Approach",
    "body": "Hello Mark,\n\nWe would like to notify you of the recent updates to the Instrument Approach Procedure for Vancouver International (CYVR). The new procedure includes revised descent profiles, updated altitudes, and additional wind shear warnings during final approach. These changes have been implemented to enhance safety and operational efficiency.\n\nPlease update your system with the new procedure details and circulate the changes to the flight operations team. For further clarification, refer to the attached revised procedure document.\n\nThank you,\nProcedures Department",
    "sender": "procedures@canpass.ca",
    "recipient": "mark.taylor@aixm.ca",
    "date": "2024-02-28",
    "category": "Procedure Update"
  },
  {
    "id": 5,
    "subject": "Regulatory Change Notification",
    "body": "Greetings,\n\nWe are writing to inform you that, effective July 1, 2025, there will be significant changes to the flight restrictions in the Ottawa region. This update is in line with the latest regulatory guidelines, which now mandate stricter safety measures and revised operational procedures. All associated documents and manuals should be revised accordingly.\n\nPlease ensure that the regulatory team reviews the updated guidelines and implements the necessary changes promptly. A meeting is scheduled next week to discuss the impact of these changes.\n\nSincerely,\nRegulations Team",
    "sender": "regulations@canpass.ca",
    "recipient": "reg.team@aixm.ca",
    "date": "2024-03-10",
    "category": "Regulatory Change"
  },
  {
    "id": 6,
    "subject": "Weather Alert for Quebec Region",
    "body": "Hello,\n\nDue to the forecasted severe weather conditions in the Quebec region, please be advised that all flight schedules may experience delays. Our meteorological team has issued a weather alert and is closely monitoring the situation. We advise all operations centers to prepare for potential disruptions and communicate any changes to the flight crews immediately.\n\nStay safe and please keep us updated on any developments.\n\nBest regards,\nWeather Service",
    "sender": "weather@canpass.ca",
    "recipient": "ops@aixm.ca",
    "date": "2024-03-12",
    "category": "Weather Alert"
  },
  {
    "id": 7,
    "subject": "Emergency Procedure Update",
    "body": "Dear Team,\n\nFollowing the latest safety audits, we have revised the emergency evacuation procedures for Montreal-Trudeau International (CYUL). The updated procedures emphasize faster evacuation routes and enhanced coordination with local emergency services. All personnel are required to review the updated manuals and attend a refresher training session scheduled for next month.\n\nPlease update all relevant documents and ensure that the new procedures are disseminated across all departments. Let us know if there are any questions or concerns.\n\nRegards,\nSafety Office",
    "sender": "safety@canpass.ca",
    "recipient": "manuals@aixm.ca",
    "date": "2024-02-20",
    "category": "Emergency Procedure"
  },
  {
    "id": 8,
    "subject": "Airspace Designation Change Notification",
    "body": "Hi,\n\nPlease note that the airspace designation for the Canadian FIR in the Atlantic region has been revised. The updated boundaries now include additional airspace to better manage traffic flow. A detailed map and revised coordinates are attached for your review.\n\nWe request that the airspace team update the central database and notify all relevant stakeholders about this change as soon as possible.\n\nThank you,\nAirspace Management",
    "sender": "airspace@canpass.ca",
    "recipient": "airspace.team@aixm.ca",
    "date": "2024-03-05",
    "category": "Airspace Designation"
  },
  {
    "id": 9,
    "subject": "Maintenance Approval for Lighting Systems",
    "body": "Hello,\n\nThis email is to confirm that the maintenance work for the lighting systems at Edmonton International (CYEG) has been approved. The scheduled work will commence on May 1, 2025, and is expected to take approximately two weeks to complete. The maintenance team has been briefed and all necessary safety measures are in place.\n\nPlease update your maintenance logs and inform the operations department of the planned work. Let us know if additional support is required.\n\nBest,\nMaintenance Department",
    "sender": "maintenance@canpass.ca",
    "recipient": "edmonton@aixm.ca",
    "date": "2024-03-18",
    "category": "Maintenance Approval"
  },
  {
    "id": 10,
    "subject": "New Flight Route Approval",
    "body": "Dear Operations,\n\nWe are pleased to announce that the new flight route from Vancouver (CYVR) to Calgary (CYYC) has been approved with the designator UA303. This route is expected to optimize air traffic flow and reduce overall flight times significantly.\n\nPlease update the flight route database accordingly and ensure that all relevant teams are informed about the new route. Detailed route specifications and operating conditions will be provided in a follow-up document.\n\nRegards,\nFlight Operations",
    "sender": "routes@canpass.ca",
    "recipient": "operations@aixm.ca",
    "date": "2024-03-22",
    "category": "Flight Route Approval"
  },
  {
    "id": 11,
    "subject": "Terminal Expansion Notification",
    "body": "Hello Team,\n\nWe are excited to inform you that the Terminal Expansion project at Toronto Pearson (CYYZ) has received final approval. This project will involve major renovations including additional boarding gates, expanded customs areas, and upgraded passenger lounges. Construction is scheduled to begin in early June 2025 and is expected to be completed by late 2026.\n\nPlease coordinate with the infrastructure and planning teams to update logistical plans accordingly, and ensure that all stakeholder communications are aligned with the project timeline.\n\nBest regards,\nTerminal Development",
    "sender": "terminal@canpass.ca",
    "recipient": "infrastructure@aixm.ca",
    "date": "2024-04-01",
    "category": "Terminal Expansion"
  },
  {
    "id": 12,
    "subject": "Cargo Facility Update",
    "body": "Dear Logistics Team,\n\nThis is to notify you that the cargo handling facility at Vancouver International (CYVR) has been upgraded to improve efficiency and safety. The upgrades include new loading docks, enhanced security measures, and state-of-the-art tracking systems. The facility will begin operating with these improvements on April 20, 2025.\n\nPlease update your operational guidelines and communicate these changes to all cargo and logistics partners. Additional documentation on the facility upgrades is attached for your review.\n\nSincerely,\nCargo Management",
    "sender": "cargo@canpass.ca",
    "recipient": "logistics@aixm.ca",
    "date": "2024-04-05",
    "category": "Cargo Facility Update"
  },
  {
    "id": 13,
    "subject": "Security Protocol Update",
    "body": "Hi Security Team,\n\nDue to recent global security developments, we have revised the security protocols for all Canadian airports. The updated protocols include stricter access controls, enhanced screening procedures, and additional surveillance measures. All airport security personnel are required to review the updated guidelines and attend a mandatory training session scheduled for next week.\n\nPlease confirm once you have updated your operational procedures and that your teams are fully briefed on the new security measures.\n\nRegards,\nSecurity Office",
    "sender": "security@canpass.ca",
    "recipient": "security.team@aixm.ca",
    "date": "2024-04-10",
    "category": "Security Protocol Update"
  },
  {
    "id": 14,
    "subject": "Crew Scheduling Change Notification",
    "body": "Dear Crew Scheduling,\n\nThis is to inform you that there have been changes to the crew scheduling for the upcoming month. Due to operational requirements and seasonal adjustments, several crew shifts have been updated. Please review the attached schedule and update your records accordingly. For any discrepancies or questions, do not hesitate to contact the operations manager.\n\nThank you for your cooperation.\n\nBest regards,\nCrew Management",
    "sender": "crew@canpass.ca",
    "recipient": "scheduling@aixm.ca",
    "date": "2024-04-15",
    "category": "Crew Scheduling Change"
  },
  {
    "id": 15,
    "subject": "Fuel Price Update Notification",
    "body": "Hello Team,\n\nPlease be advised that the fuel prices at several Canadian airports have been updated due to recent market fluctuations. The new fuel pricing will be effective from May 1, 2025. We advise all relevant departments to update their operational cost calculations and notify the flight operations teams accordingly.\n\nA detailed breakdown of the updated fuel rates is attached to this email. Your prompt attention to this matter is appreciated.\n\nBest regards,\nFuel Management",
    "sender": "fuel@canpass.ca",
    "recipient": "finance@aixm.ca",
    "date": "2024-04-20",
    "category": "Fuel Price Update"
  },
  {
    "id": 16,
    "subject": "Flight Route Expansion Request",
    "body": "Hello Flight Ops,\n\nWe would like to propose an expansion of the current flight route network from Edmonton (CYEG) to Yellowknife (CYZF). This new route is expected to facilitate cargo operations and improve connectivity in the northern region. Please review the attached feasibility study and let us know if additional information is needed.\n\nRegards,\nRoute Planning Team",
    "sender": "routes@canpass.ca",
    "recipient": "flightops@aixm.ca",
    "date": "2024-05-10",
    "category": "Flight Route Approval"
  },
  {
    "id": 17,
    "subject": "Runway Extension Feasibility Study",
    "body": "Dear Engineering,\n\nWe have received a request to conduct a feasibility study for extending Runway 12/30 at Winnipeg International (CYWG) by an additional 500 meters. The goal is to accommodate larger aircraft and expand international operations. Please coordinate with the construction team and provide a preliminary cost estimate.\n\nThank you,\nAirport Planning Department",
    "sender": "planning@canpass.ca",
    "recipient": "engineering@aixm.ca",
    "date": "2024-06-01",
    "category": "Runway Modification"
  },
  {
    "id": 18,
    "subject": "Winter Operations Briefing",
    "body": "Hello Operations Team,\n\nAs we approach the winter season, we have updated the runway friction measurement procedures and snow removal protocols for all airports in the Quebec region. Please ensure that all ground handling teams and snow removal crews are briefed on the revised guidelines. A mandatory training session is scheduled for November 15, 2025.\n\nBest,\nWinter Ops Coordination",
    "sender": "winterops@canpass.ca",
    "recipient": "ops.team@aixm.ca",
    "date": "2024-10-20",
    "category": "Weather Alert"
  },
  {
    "id": 19,
    "subject": "Satellite-Based Approach Procedure Implementation",
    "body": "Dear Procedures Department,\n\nWe are pleased to announce the implementation of a new satellite-based approach procedure for Halifax Stanfield International (CYHZ). This procedure is expected to enhance navigational accuracy and reduce the risk of missed approaches during adverse weather conditions. Please coordinate with the ATC unit to finalize documentation.\n\nThank you,\nNav Services",
    "sender": "navservices@canpass.ca",
    "recipient": "procedures@aixm.ca",
    "date": "2024-07-05",
    "category": "Procedure Update"
  },
  {
    "id": 20,
    "subject": "Bird Hazard Advisory",
    "body": "Hi Safety Team,\n\nWe have received multiple reports of increased bird activity near Regina International (CYQR). Pilots have reported flocks of geese along the approach path. We recommend issuing a NOTAM and reminding crews to follow bird-strike avoidance procedures. Please update the hazard database accordingly.\n\nRegards,\nWildlife Management",
    "sender": "wildlife@canpass.ca",
    "recipient": "safety@aixm.ca",
    "date": "2024-08-02",
    "category": "NOTAM"
  },
  {
    "id": 21,
    "subject": "Emergency Firefighting Exercise Schedule",
    "body": "Hello Team,\n\nAn emergency firefighting exercise will be conducted at Ottawa Macdonald-Cartier International (CYOW) on March 10, 2025. All relevant departments, including local fire services and airport security, must participate. Please confirm the availability of your teams and finalize the exercise scenario details.\n\nBest,\nEmergency Planning",
    "sender": "emergency@canpass.ca",
    "recipient": "ops@aixm.ca",
    "date": "2024-11-15",
    "category": "Emergency Procedure"
  },
  {
    "id": 22,
    "subject": "Noise Abatement Regulation Update",
    "body": "Dear Regulatory Team,\n\nEffective January 1, 2026, stricter noise abatement procedures will be enforced at airports located within 50 km of major residential areas. This update is in accordance with the latest environmental protection guidelines. Please ensure that all noise contour maps and pilot briefings are revised accordingly.\n\nRegards,\nEnvironmental Office",
    "sender": "environment@canpass.ca",
    "recipient": "reg.team@aixm.ca",
    "date": "2024-12-05",
    "category": "Regulatory Change"
  },
  {
    "id": 23,
    "subject": "Airspace Class Revision Proposal",
    "body": "Hello Airspace Team,\n\nA proposal has been submitted to reclassify certain sections of airspace around Calgary (CYYC) from Class C to Class B to accommodate increasing traffic volume. We request a thorough review of traffic data and coordination with NAV CANADA. A draft of the revised airspace chart is attached.\n\nBest,\nAirspace Management",
    "sender": "airspace@canpass.ca",
    "recipient": "airspace.team@aixm.ca",
    "date": "2025-01-10",
    "category": "Airspace Designation"
  },
  {
    "id": 24,
    "subject": "Fuel Price Adjustment Notice",
    "body": "Dear Finance,\n\nPlease be advised that due to global market fluctuations, fuel prices at major Canadian airports will increase by an average of 4% starting July 1, 2025. We recommend updating operational cost forecasts and informing airline partners. Detailed rate tables are attached.\n\nRegards,\nFuel Management",
    "sender": "fuel@canpass.ca",
    "recipient": "finance@aixm.ca",
    "date": "2025-03-01",
    "category": "Fuel Price Update"
  },
  {
    "id": 25,
    "subject": "Cargo Facility Expansion Approval",
    "body": "Hello Logistics,\n\nWe are pleased to inform you that the proposed expansion of the cargo handling facility at Hamilton International (CYHM) has been approved. Construction is scheduled to begin in August 2025, with a projected completion date of mid-2026. Please update your capacity planning models accordingly.\n\nBest,\nCargo Development",
    "sender": "cargo@canpass.ca",
    "recipient": "logistics@aixm.ca",
    "date": "2025-04-12",
    "category": "Cargo Facility Update"
  },
  {
    "id": 26,
    "subject": "Terminal Security Upgrade Notice",
    "body": "Hi Security Team,\n\nThe terminal security systems at Kelowna International (CYLW) are scheduled for a major upgrade starting September 2025. This includes the installation of new access control systems and advanced screening equipment. Please ensure that all security staff are trained on the updated protocols.\n\nRegards,\nSecurity Upgrades Department",
    "sender": "security@canpass.ca",
    "recipient": "security.team@aixm.ca",
    "date": "2025-05-20",
    "category": "Security Protocol Update"
  },
  {
    "id": 27,
    "subject": "Crew Scheduling Roster for Summer Season",
    "body": "Dear Crew Management,\n\nThis is to notify you that the crew scheduling roster for the summer season (June to August) has been finalized. Due to increased tourist traffic, we have added additional flights to popular destinations. Please review the roster and confirm the availability of all crew members.\n\nBest regards,\nOperations Planning",
    "sender": "ops@canpass.ca",
    "recipient": "crew@aixm.ca",
    "date": "2025-02-28",
    "category": "Crew Scheduling Change"
  },
  {
    "id": 28,
    "subject": "Runway Grooving Maintenance Advisory",
    "body": "Hello Maintenance,\n\nWe have observed reduced traction on Runway 04/22 at St. John's International (CYYT) due to wear on the grooved surface. A maintenance window is available in May 2026 for re-grooving and friction testing. Please coordinate with the engineering team to schedule the necessary work.\n\nRegards,\nRunway Operations",
    "sender": "runwayops@canpass.ca",
    "recipient": "maintenance@aixm.ca",
    "date": "2025-07-18",
    "category": "Runway Modification"
  },
  {
    "id": 29,
    "subject": "Regulatory Amendment: Drone Operations",
    "body": "Dear Regulatory Department,\n\nAn amendment has been issued regarding drone operations within controlled airspace near Vancouver (CYVR). All drone flights above 400 ft AGL now require special clearance. Please incorporate this amendment into the existing regulations and disseminate the updates to local operators.\n\nThank you,\nUAS Office",
    "sender": "uas@canpass.ca",
    "recipient": "reg.team@aixm.ca",
    "date": "2025-08-01",
    "category": "Regulatory Change"
  },
  {
    "id": 30,
    "subject": "New Instrument Landing System Calibration",
    "body": "Hi Procedures,\n\nA new ILS has been installed at Fredericton International (CYFC). We are scheduling a calibration flight for February 15, 2026, to verify accuracy. Please coordinate with the flight check team and ATC to ensure minimal disruptions to regular traffic.\n\nRegards,\nNavigation Systems",
    "sender": "nav@canpass.ca",
    "recipient": "procedures@aixm.ca",
    "date": "2025-09-10",
    "category": "Procedure Update"
  },
  {
    "id": 31,
    "subject": "Emergency Evacuation Drill - Dry Run",
    "body": "Hello Safety Office,\n\nA dry run of the emergency evacuation procedures at Billy Bishop Toronto City Airport (CYTZ) is scheduled for April 5, 2026. This drill will involve airline staff, local fire services, and volunteer passengers. Please finalize the scenario outline and resource allocation.\n\nBest,\nEmergency Planning",
    "sender": "emergency@canpass.ca",
    "recipient": "safety@aixm.ca",
    "date": "2025-10-01",
    "category": "Emergency Procedure"
  },
  {
    "id": 32,
    "subject": "Aircraft De-Icing Fluid Shortage Alert",
    "body": "Dear Operations,\n\nWe have been informed of a potential shortage in aircraft de-icing fluid supplies due to supplier constraints. This may impact winter operations at multiple airports, particularly in the Prairie region. Please advise all stations to monitor usage closely and consider alternative sourcing.\n\nThank you,\nSupply Chain Management",
    "sender": "supply@canpass.ca",
    "recipient": "operations@aixm.ca",
    "date": "2025-11-05",
    "category": "Weather Alert"
  },
  {
    "id": 33,
    "subject": "Fuel Price Decrease Notification",
    "body": "Hello Finance,\n\nEffective September 1, 2026, fuel prices at Canadian airports will be reduced by an average of 3%, following recent market adjustments. Please update the financial projections and communicate the revised rates to all airline partners.\n\nRegards,\nFuel Management",
    "sender": "fuel@canpass.ca",
    "recipient": "finance@aixm.ca",
    "date": "2026-01-10",
    "category": "Fuel Price Update"
  },
  {
    "id": 34,
    "subject": "Terminal Expansion Milestone Update",
    "body": "Hi Infrastructure Team,\n\nThe terminal expansion project at Calgary International (CYYC) has reached its second milestone. The new passenger concourse framework is complete, and interior finishing is slated to begin next month. Please review the updated project schedule and resource allocations.\n\nBest regards,\nTerminal Development",
    "sender": "terminal@canpass.ca",
    "recipient": "infrastructure@aixm.ca",
    "date": "2025-12-15",
    "category": "Terminal Expansion"
  },
  {
    "id": 35,
    "subject": "Cargo Facility Safety Audit",
    "body": "Dear Cargo Management,\n\nA comprehensive safety audit of the cargo facility at Halifax Stanfield International (CYHZ) is scheduled for March 2026. This audit will focus on operational efficiency, security compliance, and hazardous materials handling. Please prepare all relevant documentation.\n\nThank you,\nSafety Audits",
    "sender": "safety@canpass.ca",
    "recipient": "cargo@aixm.ca",
    "date": "2026-02-01",
    "category": "Cargo Facility Update"
  },
  {
    "id": 36,
    "subject": "Airport Designation Update",
    "body": "Hello,\n\nWe are pleased to announce that Maple Ridge Regional (MRR) has been officially designated as a CANPASS airport effective from August 15, 2026. Please update all operational databases accordingly.\n\nRegards,\nAirport Administration",
    "sender": "admin@canpass.ca",
    "recipient": "operations@aixm.ca",
    "date": "2026-07-20",
    "category": "Airport Approval"
  },
  {
    "id": 37,
    "subject": "Runway Maintenance Schedule Confirmation",
    "body": "Dear Maintenance Team,\n\nThis email confirms the scheduled maintenance for Runway 02/20 at Saskatoon International (CYSK) on September 10, 2026. All safety protocols must be strictly followed.\n\nBest,\nMaintenance Department",
    "sender": "maintenance@canpass.ca",
    "recipient": "team@aixm.ca",
    "date": "2026-08-30",
    "category": "Runway Modification"
  },
  {
    "id": 38,
    "subject": "NOTAM: Temporary Airspace Closure",
    "body": "Hello Airspace Team,\n\nPlease note that a temporary closure of controlled airspace over the downtown area of Vancouver (CYVR) will be effective from October 1 to October 3, 2026 due to a VIP event. Ensure that all flight operations are adjusted accordingly.\n\nThank you,\nAirspace Control",
    "sender": "airspace@canpass.ca",
    "recipient": "control@aixm.ca",
    "date": "2026-09-15",
    "category": "NOTAM"
  },
  {
    "id": 39,
    "subject": "Procedure Update: New VFR Departure Procedure",
    "body": "Dear Flight Procedures,\n\nA new Visual Flight Rules (VFR) departure procedure has been implemented for Langley Regional (CYLY). Please review the attached document and update your operational guidelines.\n\nRegards,\nProcedures Department",
    "sender": "procedures@canpass.ca",
    "recipient": "flightops@aixm.ca",
    "date": "2026-10-05",
    "category": "Procedure Update"
  },
  {
    "id": 40,
    "subject": "Regulatory Update: Environmental Compliance",
    "body": "Greetings,\n\nEffective November 1, 2026, new environmental compliance regulations will require all Canadian airports to reduce carbon emissions by 15%. Please ensure that your departments are prepared to implement these changes.\n\nSincerely,\nRegulatory Affairs",
    "sender": "regulatory@canpass.ca",
    "recipient": "enviro@aixm.ca",
    "date": "2026-10-20",
    "category": "Regulatory Change"
  },
  {
    "id": 41,
    "subject": "Weather Alert: Severe Thunderstorms",
    "body": "Hello,\n\nA severe thunderstorm warning has been issued for the Winnipeg area. Expect potential delays and disruptions in flight schedules at Winnipeg International (CYWG). Please notify all relevant teams.\n\nBest,\nWeather Service",
    "sender": "weather@canpass.ca",
    "recipient": "ops@aixm.ca",
    "date": "2026-11-10",
    "category": "Weather Alert"
  },
  {
    "id": 42,
    "subject": "Emergency Procedure Drill Announcement",
    "body": "Dear Safety Team,\n\nAn emergency evacuation drill for Fredericton International (CYFC) is scheduled on December 5, 2026. All departments must participate. Please ensure all emergency protocols are reviewed prior to the drill.\n\nRegards,\nSafety Office",
    "sender": "safety@canpass.ca",
    "recipient": "emergency@aixm.ca",
    "date": "2026-11-25",
    "category": "Emergency Procedure"
  },
  {
    "id": 43,
    "subject": "Airspace Adjustment Notification",
    "body": "Hi Airspace Team,\n\nDue to updated traffic data, the airspace boundaries around Edmonton International (CYEG) have been adjusted. Please update your charts and notify pilots of the new routes.\n\nThank you,\nAirspace Management",
    "sender": "airspace@canpass.ca",
    "recipient": "charts@aixm.ca",
    "date": "2026-12-01",
    "category": "Airspace Designation"
  },
  {
    "id": 44,
    "subject": "Maintenance Approval: Terminal Lighting Replacement",
    "body": "Hello,\n\nThe maintenance team has approved the replacement of outdated terminal lighting systems at Halifax Stanfield International (CYHZ). Work will commence on January 15, 2027. Kindly update maintenance logs accordingly.\n\nRegards,\nMaintenance Department",
    "sender": "maintenance@canpass.ca",
    "recipient": "terminal@aixm.ca",
    "date": "2026-12-20",
    "category": "Maintenance Approval"
  },
  {
    "id": 45,
    "subject": "Flight Route Extension Proposal",
    "body": "Dear Flight Operations,\n\nWe propose extending the current flight route from Montreal (CYUL) to Ottawa (YOW) to include a stopover for refueling. Please review the attached proposal and provide feedback.\n\nThank you,\nRoute Planning",
    "sender": "routes@canpass.ca",
    "recipient": "flightops@aixm.ca",
    "date": "2027-01-05",
    "category": "Flight Route Approval"
  },
  {
    "id": 46,
    "subject": "Terminal Expansion Project Phase 3 Update",
    "body": "Hello Infrastructure Team,\n\nThe Terminal Expansion project at Calgary International (CYYC) has entered Phase 3, which focuses on retail and dining area improvements. Please update project schedules and allocate necessary resources.\n\nBest regards,\nTerminal Development",
    "sender": "terminal@canpass.ca",
    "recipient": "infrastructure@aixm.ca",
    "date": "2027-01-15",
    "category": "Terminal Expansion"
  },
  {
    "id": 47,
    "subject": "Cargo Facility Upgrade Notification",
    "body": "Dear Logistics,\n\nWe are announcing upgrades to the cargo facility at Winnipeg International (CYSK) to include automated sorting systems. The work is scheduled to begin in February 2027. Kindly update all operational guidelines.\n\nSincerely,\nCargo Management",
    "sender": "cargo@canpass.ca",
    "recipient": "logistics@aixm.ca",
    "date": "2027-01-25",
    "category": "Cargo Facility Update"
  },
  {
    "id": 48,
    "subject": "Security Protocol Training Reminder",
    "body": "Hi Security Team,\n\nThis is a reminder that mandatory security protocol training will be held on February 10, 2027, at Toronto Pearson International (CYYZ). Please ensure all security personnel are scheduled to attend.\n\nBest,\nSecurity Office",
    "sender": "security@canpass.ca",
    "recipient": "security.team@aixm.ca",
    "date": "2027-01-30",
    "category": "Security Protocol Update"
  },
  {
    "id": 49,
    "subject": "Crew Scheduling Adjustment for Winter Operations",
    "body": "Dear Crew Management,\n\nDue to expected increased winter demand, we have updated the crew scheduling for the period December 2026 to February 2027. Please review the new roster and confirm any adjustments as needed.\n\nRegards,\nCrew Management",
    "sender": "crew@canpass.ca",
    "recipient": "scheduling@aixm.ca",
    "date": "2027-02-05",
    "category": "Crew Scheduling Change"
  },
  {
    "id": 50,
    "subject": "Fuel Price Stabilization Update",
    "body": "Hello Finance Team,\n\nWe are pleased to inform you that recent market conditions have led to a stabilization in fuel prices at major Canadian airports. Effective March 1, 2027, current rates will remain unchanged. Please update all financial models accordingly.\n\nBest regards,\nFuel Management",
    "sender": "fuel@canpass.ca",
    "recipient": "finance@aixm.ca",
    "date": "2027-02-15",
    "category": "Fuel Price Update"
  },
  {
    "id": 51,
    "subject": "Drone Operation Regulation Notification",
    "body": "Dear Regulatory Department,\n\nNew regulations require all drone operations within 5 km of Canadian airports to have pre-approved flight plans. This change is effective from March 15, 2027. Please review and update the regulatory framework accordingly.\n\nThank you,\nUAS Office",
    "sender": "uas@canpass.ca",
    "recipient": "reg.team@aixm.ca",
    "date": "2027-02-20",
    "category": "Regulatory Change"
  },
  {
    "id": 52,
    "subject": "Airport Infrastructure Investment Proposal",
    "body": "Hello Board,\n\nWe are proposing a new investment in airport infrastructure at Vancouver International (CYVR), focusing on improved terminal facilities and enhanced baggage handling systems. Please review the attached proposal and provide your feedback at the upcoming meeting.\n\nRegards,\nInfrastructure Team",
    "sender": "infrastructure@canpass.ca",
    "recipient": "board@aixm.ca",
    "date": "2027-02-28",
    "category": "Airport Approval"
  },
  {
    "id": 53,
    "subject": "Passenger Service Enhancement Initiative",
    "body": "Dear Customer Service,\n\nA new initiative aimed at enhancing passenger services at Montreal-Trudeau International (CYUL) has been approved. This includes improvements in check-in processes, lounge facilities, and real-time flight information displays. Please update your service protocols accordingly.\n\nBest regards,\nCustomer Experience Team",
    "sender": "customerservice@canpass.ca",
    "recipient": "service@aixm.ca",
    "date": "2027-03-05",
    "category": "Procedure Update"
  },
  {
    "id": 54,
    "subject": "Air Traffic Control System Upgrade Notice",
    "body": "Hello ATC Team,\n\nA major upgrade to the air traffic control system at Toronto Pearson (CYYZ) is scheduled to begin in April 2027. This upgrade will incorporate advanced radar and communication technologies to enhance operational efficiency. Please prepare for system downtime during the upgrade period.\n\nThank you,\nATC Department",
    "sender": "atc@canpass.ca",
    "recipient": "atc.team@aixm.ca",
    "date": "2027-03-15",
    "category": "Procedure Update"
  },
  {
    "id": 55,
    "subject": "Sustainability Initiative: Renewable Energy Integration",
    "body": "Dear Sustainability Team,\n\nWe are launching a new initiative to integrate renewable energy sources at several Canadian airports. The first phase involves installing solar panels at Calgary International (CYYC) and Vancouver International (CYVR). Please update your environmental impact reports and plan for upcoming sustainability audits.\n\nBest regards,\nSustainability Office",
    "sender": "sustainability@canpass.ca",
    "recipient": "sustainability@aixm.ca",
    "date": "2027-03-25",
    "category": "Regulatory Change"
  },
  {
    "id": 56,
    "subject": "New Cargo Terminal Proposal",
    "body": "Hello Logistics Team,\n\nWe propose the construction of a new cargo terminal at Calgary International (CYYC) to support increasing cargo volume. The proposal includes cost estimates, design schematics, and a preliminary timeline for completion. Please review the attached proposal and provide feedback.\n\nRegards,\nCargo Development Team",
    "sender": "cargo@canpass.ca",
    "recipient": "logistics@aixm.ca",
    "date": "2027-04-05",
    "category": "Terminal Expansion"
  },
  {
    "id": 57,
    "subject": "Air Traffic Control System Maintenance",
    "body": "Dear ATC Team,\n\nScheduled maintenance for the air traffic control systems at Montreal-Trudeau International (CYUL) is set for May 10, 2027. This maintenance will include system updates and performance improvements. Please prepare for a brief service interruption.\n\nBest,\nATC Department",
    "sender": "atc@canpass.ca",
    "recipient": "atc.team@aixm.ca",
    "date": "2027-04-10",
    "category": "Procedure Update"
  },
  {
    "id": 58,
    "subject": "Regulatory Notice: Drone Flight Restrictions",
    "body": "Hello Regulatory Team,\n\nEffective June 1, 2027, new restrictions on drone flights near major airports will be enforced. All operators must secure permits for flights within 3 km of controlled airspace. Please update the regulations and notify all stakeholders.\n\nSincerely,\nUAS Office",
    "sender": "uas@canpass.ca",
    "recipient": "reg.team@aixm.ca",
    "date": "2027-04-15",
    "category": "Regulatory Change"
  },
  {
    "id": 59,
    "subject": "Emergency Response Drill Notification",
    "body": "Dear Safety and Emergency Teams,\n\nAn emergency response drill is scheduled for June 5, 2027 at Calgary International (CYYC). This drill will simulate a multi-agency response to a security breach. Please ensure all teams are briefed and ready to participate.\n\nBest regards,\nSafety Office",
    "sender": "safety@canpass.ca",
    "recipient": "emergency@aixm.ca",
    "date": "2027-04-20",
    "category": "Emergency Procedure"
  },
  {
    "id": 60,
    "subject": "Runway Pavement Evaluation Report",
    "body": "Hello Engineering Team,\n\nAttached is the latest runway pavement evaluation report for Toronto Pearson International (CYYZ). The report highlights areas needing immediate repair and long-term maintenance recommendations. Please review and schedule necessary actions.\n\nThank you,\nEngineering Department",
    "sender": "engineering@canpass.ca",
    "recipient": "maintenance@aixm.ca",
    "date": "2027-04-25",
    "category": "Runway Modification"
  },
  {
    "id": 61,
    "subject": "New Airport Security Screening Protocols",
    "body": "Dear Security Team,\n\nIn light of recent security incidents, updated screening protocols have been developed for all Canadian airports. Please review the attached guidelines and implement the changes at your earliest convenience.\n\nRegards,\nSecurity Office",
    "sender": "security@canpass.ca",
    "recipient": "security.team@aixm.ca",
    "date": "2027-05-01",
    "category": "Security Protocol Update"
  },
  {
    "id": 62,
    "subject": "Passenger Experience Survey Results",
    "body": "Hello Customer Service,\n\nWe have compiled the results from the recent passenger experience survey conducted at Vancouver International (CYVR). The survey identifies key areas for improvement in check-in processes, lounge comfort, and flight information systems. Please review the report and propose actionable steps.\n\nBest,\nCustomer Experience Team",
    "sender": "customerservice@canpass.ca",
    "recipient": "service@aixm.ca",
    "date": "2027-05-05",
    "category": "Procedure Update"
  },
  {
    "id": 63,
    "subject": "Terminal Renovation Project Kickoff",
    "body": "Dear Infrastructure Team,\n\nThe terminal renovation project at Halifax Stanfield International (CYHZ) is scheduled to commence on June 15, 2027. The project includes modernizing passenger facilities and expanding retail spaces. Please review the project plan and confirm your resource allocations.\n\nSincerely,\nTerminal Development",
    "sender": "terminal@canpass.ca",
    "recipient": "infrastructure@aixm.ca",
    "date": "2027-05-10",
    "category": "Terminal Expansion"
  },
  {
    "id": 64,
    "subject": "Cargo Operations Efficiency Initiative",
    "body": "Hi Cargo Team,\n\nWe are launching an initiative to improve the efficiency of cargo operations at Edmonton International (CYEG). The plan includes upgrading sorting systems and streamlining logistics. Please review the attached strategy document and implement the recommended changes.\n\nBest regards,\nCargo Management",
    "sender": "cargo@canpass.ca",
    "recipient": "logistics@aixm.ca",
    "date": "2027-05-15",
    "category": "Cargo Facility Update"
  },
  {
    "id": 65,
    "subject": "New Runway Lighting System Proposal",
    "body": "Dear Maintenance,\n\nA proposal for a new runway lighting system at Ottawa Macdonald-Cartier International (CYOW) has been approved by the board. The new system aims to improve visibility and safety during night operations. Please update your maintenance schedules and prepare for installation.\n\nRegards,\nMaintenance Department",
    "sender": "maintenance@canpass.ca",
    "recipient": "ops@aixm.ca",
    "date": "2027-05-20",
    "category": "Maintenance Approval"
  },
  {
    "id": 66,
    "subject": "Flight Operations Coordination Meeting",
    "body": "Hello Team,\n\nA coordination meeting for flight operations will be held on May 30, 2027 to discuss new route proposals and scheduling adjustments. Please ensure that all relevant data is prepared and shared in advance.\n\nBest,\nFlight Operations",
    "sender": "routes@canpass.ca",
    "recipient": "ops.team@aixm.ca",
    "date": "2027-05-25",
    "category": "Flight Route Approval"
  },
  {
    "id": 67,
    "subject": "Regulatory Compliance Audit Notice",
    "body": "Dear Compliance Team,\n\nAn audit to ensure regulatory compliance across all airport operations is scheduled for June 10, 2027. Please prepare all necessary documentation and ensure that any non-compliant areas are addressed promptly.\n\nSincerely,\nRegulatory Affairs",
    "sender": "regulatory@canpass.ca",
    "recipient": "reg.team@aixm.ca",
    "date": "2027-05-30",
    "category": "Regulatory Change"
  },
  {
    "id": 68,
    "subject": "Enhanced In-Flight Entertainment Proposal",
    "body": "Hi Customer Service,\n\nA proposal for enhanced in-flight entertainment systems has been approved for implementation on select domestic flights from Toronto Pearson (CYYZ). The proposal outlines new content offerings and technical upgrades. Please update the service guidelines accordingly.\n\nRegards,\nCustomer Experience Team",
    "sender": "customerservice@canpass.ca",
    "recipient": "service@aixm.ca",
    "date": "2027-06-05",
    "category": "Procedure Update"
  },
  {
    "id": 69,
    "subject": "Terminal Parking Expansion Initiative",
    "body": "Dear Infrastructure Team,\n\nWe are proposing an expansion of the terminal parking facilities at Calgary International (CYYC) to accommodate increased passenger volume. Please review the attached feasibility study and provide your input on potential design modifications.\n\nBest regards,\nTerminal Development",
    "sender": "terminal@canpass.ca",
    "recipient": "infrastructure@aixm.ca",
    "date": "2027-06-10",
    "category": "Terminal Expansion"
  },
  {
    "id": 70,
    "subject": "Safety Inspection Report - Runway 07/25",
    "body": "Hello Safety Team,\n\nAttached is the latest safety inspection report for Runway 07/25 at Victoria International (CYYJ). The report highlights minor safety issues that need to be addressed immediately. Please review the report and implement the recommended fixes.\n\nThank you,\nSafety Office",
    "sender": "safety@canpass.ca",
    "recipient": "maintenance@aixm.ca",
    "date": "2027-06-15",
    "category": "Runway Modification"
  },
  {
    "id": 71,
    "subject": "Fuel Cost Analysis Update",
    "body": "Dear Finance,\n\nPlease find attached the latest analysis on fuel costs at major Canadian airports. The report indicates a potential decrease in prices due to market adjustments. Update your forecasts accordingly and communicate the changes to the relevant departments.\n\nBest,\nFuel Management",
    "sender": "fuel@canpass.ca",
    "recipient": "finance@aixm.ca",
    "date": "2027-06-20",
    "category": "Fuel Price Update"
  },
  {
    "id": 72,
    "subject": "Crew Training Session Announcement",
    "body": "Hello Crew Management,\n\nWe are organizing a new training session focusing on advanced safety procedures and customer service enhancements for flight attendants. The training is scheduled for July 5, 2027. Please ensure all crew members are informed and registered.\n\nRegards,\nCrew Management",
    "sender": "crew@canpass.ca",
    "recipient": "scheduling@aixm.ca",
    "date": "2027-06-25",
    "category": "Crew Scheduling Change"
  },
  {
    "id": 73,
    "subject": "Airline Partnership Proposal",
    "body": "Dear Business Development,\n\nWe have received a proposal from a major airline to establish a new partnership for enhanced route sharing between Montreal (CYUL) and Vancouver (CYVR). Please review the proposal and prepare a detailed analysis of potential benefits and challenges.\n\nBest regards,\nBusiness Development Team",
    "sender": "business@canpass.ca",
    "recipient": "bd@aixm.ca",
    "date": "2027-07-01",
    "category": "Airport Approval"
  },
  {
    "id": 74,
    "subject": "Terminal Wi-Fi Upgrade Notice",
    "body": "Hi IT Department,\n\nA proposal for upgrading terminal Wi-Fi systems at Toronto Pearson (CYYZ) has been approved. This upgrade will improve connectivity for passengers and staff. Please schedule the necessary IT work and coordinate with the network providers.\n\nThank you,\nIT Services",
    "sender": "it@canpass.ca",
    "recipient": "it.team@aixm.ca",
    "date": "2027-07-05",
    "category": "Procedure Update"
  },
  {
    "id": 75,
    "subject": "Sustainability Audit for Airport Operations",
    "body": "Hello Sustainability Team,\n\nWe are initiating a comprehensive sustainability audit for all airport operations at major hubs. The audit will assess energy usage, waste management, and carbon emissions. Please prepare your departmental reports and schedules for the audit starting in August 2027.\n\nBest regards,\nSustainability Office",
    "sender": "sustainability@canpass.ca",
    "recipient": "sustainability@aixm.ca",
    "date": "2027-07-10",
    "category": "Regulatory Change"
  }
]

